
Model: "Ross_Model"
__________________________________________________________________________________________
Layer (type)                                           Output Shape              Param # 
==========================================================================================
VGG_Block_1 (Functional)                               (None, 16, 16, 64)        38720   
__________________________________________________________________________________________
Ross_block_2 (Conv2D)                                  (None, 16, 16, 128)       73856   
__________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D)                        (None, 8, 8, 128)         0       
__________________________________________________________________________________________
Ross_block_3 (Conv2D)                                  (None, 8, 8, 256)         295168  
__________________________________________________________________________________________
max_pooling2d_36 (MaxPooling2D)                        (None, 4, 4, 256)         0       
__________________________________________________________________________________________
dropout_34 (Dropout)                                   (None, 4, 4, 256)         0       
__________________________________________________________________________________________
global_average_pooling2d_17 (GlobalAveragePooling2D)   (None, 256)               0       
__________________________________________________________________________________________
batch_normalization_17 (BatchNormalization)            (None, 256)               1024    
__________________________________________________________________________________________
dropout_35 (Dropout)                                   (None, 256)               0       
__________________________________________________________________________________________
dense_34 (Dense)                                       (None, 64)                16448   
__________________________________________________________________________________________
dense_35 (Dense)                                       (None, 43)                2795    
==========================================================================================
Total params: 428,011
Trainable params: 388,779
Non-trainable params: 39,232
__________________________________________________________________________________________



